---
kind: type
id: T:Autodesk.Revit.DB.BasePoint
source: html/154074ae-d653-aaff-b84b-6336a1cbafaa.htm
---
# Autodesk.Revit.DB.BasePoint

A class representing the Project Base Point and Survey Point. Each Revit project
 contains one project base point and one survey point. The project base point represents the
 origin of the project coordinate system. The survey point represents the origin of
 the shared coordinate system.

## Syntax (C#)
```csharp
public class BasePoint : Element
```